<?php

namespace api\modules\v1\controllers;

use yii\web\Controller;

class NameController extends Controller
{
    public function actionIndex()
    {
        return array (
            1 =>
                array (
                    'G' => 'Книги',
                    'B' =>
                        array (
                            1 =>
                                array (
                                    'N' => 'Алгоритмы. Построение и анализ. Т. Кормен, Ч. Лейзерсон, Р. Ривест, К. Штайн.',
                                    'T' => 1,
                                ),
                            2 =>
                                array (
                                    'N' => 'Совершенный код. Стив Макконнелл.',
                                    'T' => 1,
                                ),
                            3 =>
                                array (
                                    'N' => 'JavaScript. Подробное руководство. Дэвид Флэнаган.',
                                    'T' => 1,
                                ),
                        ),
                ),
            2 =>
                array (
                    'G' => 'Еда',
                    'C' => 2,
                    'B' =>
                        array (
                            7 =>
                                array (
                                    'N' => 'Овсяные пирожные с шоколадной прослойкой',
                                    'T' => 3,
                                ),
                            8 =>
                                array (
                                    'N' => 'Суп с пекинской капустой',
                                    'T' => 3,
                                ),
                            85 =>
                                array (
                                    'N' => 'Вишня в коньяке',
                                    'T' => 3,
                                ),
                            86 =>
                                array (
                                    'N' => 'Постный фаршированный перец',
                                    'T' => 3,
                                ),
                            109 =>
                                array (
                                    'N' => 'Салат Подсолнух',
                                    'T' => '',
                                ),
                            110 =>
                                array (
                                    'N' => 'Форель «Эрланген»',
                                    'T' => '',
                                ),
                            111 =>
                                array (
                                    'N' => 'Салат с морепродуктами',
                                    'T' => 3,
                                ),
                            112 =>
                                array (
                                    'N' => 'Тёртый пирог',
                                    'T' => 3,
                                ),
                            115 =>
                                array (
                                    'N' => 'Свинина, маринованная в красном вине, с кориандром',
                                    'T' => '',
                                ),
                            116 =>
                                array (
                                    'N' => 'Салат с черносливом и ветчиной',
                                    'T' => '',
                                ),
                            125 =>
                                array (
                                    'N' => 'Болгарский перец и цуккини на гриле',
                                    'T' => 3,
                                ),
                            126 =>
                                array (
                                    'N' => 'Салат «Букет нарциссов»',
                                    'T' => 3,
                                ),
                            127 =>
                                array (
                                    'N' => 'Салат из морепродуктов, с огурцами, рукколой и оливками',
                                    'T' => 3,
                                ),
                        ),
                ),
            5 =>
                array (
                    'G' => 'Спорт',
                    'C' => 2,
                    'B' =>
                        array (
                            184 =>
                                array (
                                    'N' => 'Беговая дорожка',
                                    'T' => 1,
                                ),
                            185 =>
                                array (
                                    'N' => 'Гантели съемные',
                                    'T' => 1,
                                ),
                            186 =>
                                array (
                                    'N' => 'Ружьё охотничье',
                                    'T' => 1,
                                ),
                            187 =>
                                array (
                                    'N' => 'Велотренажер',
                                    'T' => 1,
                                ),
                        ),
                ),
            8 =>
                array (
                    'G' => 'Сантехника',
                    'C' => 3,
                    'B' =>
                        array (
                            4 =>
                                array (
                                    'N' => 'Акриловая ванна Alpen Mars ',
                                    'T' => 1,
                                ),
                            5 =>
                                array (
                                    'N' => 'Смеситель Sturm Classica',
                                    'T' => 1,
                                ),
                            6 =>
                                array (
                                    'N' => 'Тумба с раковиной Tiffany World ',
                                    'T' => 1,
                                ),
                        ),
                ),
            10 =>
                array (
                    'G' => 'Запчасти для машин',
                    'C' => 3,
                    'B' =>
                        array (
                            191 =>
                                array (
                                    'N' => 'Амортизатор задний CX-5 ',
                                    'T' => 3,
                                ),
                            192 =>
                                array (
                                    'N' => 'Пружина амортизатора ',
                                    'T' => 3,
                                ),
                            193 =>
                                array (
                                    'N' => 'Корпус воздушного фильтра ',
                                    'T' => 3,
                                ),
                            194 =>
                                array (
                                    'N' => 'Ремень приводной',
                                    'T' => 3,
                                ),
                            195 =>
                                array (
                                    'N' => 'Диффузор радиатора',
                                    'T' => 1,
                                ),
                            196 =>
                                array (
                                    'N' => 'Фильтр АКПП',
                                    'T' => 3,
                                ),
                        ),
                ),
            15 =>
                array (
                    'G' => 'Сувениры',
                    'C' => 2,
                    'B' =>
                        array (
                            11 =>
                                array (
                                    'N' => 'Набор для рисования Пастель',
                                    'T' => 3,
                                ),
                            12 =>
                                array (
                                    'N' => 'Брелок-рулетка',
                                    'T' => 3,
                                ),
                            63 =>
                                array (
                                    'N' => 'Брелок-открывалка',
                                    'T' => 3,
                                ),
                            64 =>
                                array (
                                    'N' => 'Ручка-стилус шариковая',
                                    'T' => 3,
                                ),
                            146 =>
                                array (
                                    'N' => 'Браслет',
                                    'T' => 3,
                                ),
                            147 =>
                                array (
                                    'N' => 'Чехол для очков',
                                    'T' => 3,
                                ),
                            148 =>
                                array (
                                    'N' => 'Сумка для выставок',
                                    'T' => 3,
                                ),
                        ),
                ),
        );
    }
}